/*********************************************************************************************
* 文件：main.c
* 作者：chennian 2017.11.02
* 说明：板载温湿度传感器实验
* 修改：zhoucj   2017.12.19 修改为读取温湿度传感器原始数据
* 注释：
*********************************************************************************************/
/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "delay.h"
#include "string.h"
#include "led.h"
#include "usart.h"
#include "htu21d.h"
#include "lcd.h"

/*********************************************************************************************
* 名称:main()
* 功能:主函数，光照检测
* 参数:无
* 返回:无
* 修改:
* 注释:
*********************************************************************************************/
void main(void)
{
  char Original_Temp = 0;
  char Original_Humi = 0;
  char temp[4]={0};
  char humi[4]={0};
  delay_init(168);                                              //延时初始化
  htu21d_init();                                                //传感器初始化
  usart_init(115200);                                           //串口初始化
  led_init();                                                   //LED初始化
  lcd_init(IIC1);                                               //LCD初始化
  LCDDrawFnt16(85, 132,85, 320, "原始温度：", 0x0000, 0xffff);  //LCD屏显示
  LCDDrawFnt16(85, 162,85, 320, "原始湿度：", 0x0000, 0xffff);  //LCD屏显示
  for(;;)                                                       //循环体
  {
    led_control(0);
    delay_ms(500);                                              //延时0.5秒
    Original_Temp=htu21d_read_temp();                           //获取当前温度原始数据
    Original_Humi=htu21d_read_humi();                           //获取当前湿度原始数据
    printf("原始温度:%d\r\n ",Original_Temp);                   //串口打印温度原始数据
    printf("原始湿度:%d\r\n ",Original_Humi);                   //串口打印湿度原始数据
    sprintf(temp,"%d\r\n",Original_Temp);                       //将温度原始数据转化为字符串存储在temp数组中
    LCDDrawAsciiDot8x16(160, 132,temp, 0x0000, 0xffff);         //显示温度原始数据                                     
    sprintf(humi,"%d\r\n",Original_Humi);                       //将湿度原始数据转化为字符串存储在hemp数组中
    LCDDrawAsciiDot8x16(160, 162,humi, 0x0000, 0xffff);         //显示湿度原始数据                                       
    led_control(D3 | D4);
    delay_ms(500);                                              //延时0.5秒
  }
}