/*********************************************************************************************
* 文件：iwdg.c
* 作者：chennian 2017.11.2
* 说明：看门狗程序代码    
* 功能：
* 实验现象：
*********************************************************************************************/

#include  "iwdg.h"

/*********************************************************************************************
* 名称：wdg_init
* 功能：看门狗初始化
* 参数：prer 预分频值 rlr 计数器重载值
* 返回：无
* 修改：
*********************************************************************************************/
void wdg_init(char prer,int rlr)
{
  IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);                 //使能pr、rlr寄存器写操作
  IWDG_SetPrescaler(prer);                                      //设置预分频值
  IWDG_SetReload(rlr);                                          //设置重载值
  IWDG_ReloadCounter();                                         //计数器重载
  IWDG_Enable();                                                //独立看门狗使能
}

/*********************************************************************************************
* 名称：wdg_feed
* 功能：喂狗程序
* 参数：无
* 返回：无
* 修改：
*********************************************************************************************/
void wdg_feed(void)
{
  IWDG_ReloadCounter();                                         //计数器重载
}