/*********************************************************************************************
* 文件：main.c
* 作者：chennian 2017.11.2
* 说明：    
* 功能：看门的实验程序代码
*实验现象：
*       独立看门狗设置的是1s，k3按下时才回执行喂狗操作
*       所以在k3未按下时系统会每隔1s重启一次
*       k3按下，D4会以1hz的频率闪烁
*       D3仅在开机时闪烁一次
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stm32f4xx.h"
#include "delay.h"
#include "led.h"
#include "key.h"
#include "iwdg.h"
#include "stm32f4xx_iwdg.h"
/*********************************************************************************************
* 名称：main()
* 功能：
* 参数：无
* 返回：无
* 修改：
*********************************************************************************************/
void main(void)
{    
  led_init();                                                   //初始化LED控制管脚
  key_init();                                                   //初始化按键检测管脚
  delay_count(50000);                                           //延时
  wdg_init(3,1000);                                             //与分频数64，重载值为500，溢出时间为1S	
  
  turn_on(D3);                                                 //D3关
  while(1){                                                     //循环体
    
    if(get_key_status()==K3_PREESED){                           //判断K3按键是否被按下 
      wdg_feed();                                               //喂狗程序
    }
    delay_count(500);                                           //延时
    turn_on(D4);                                                //D4开
    delay_count(500);                                           //延时
    turn_off(D4);                                               //D4关
  }
}  