/*********************************************************************************************
* 文件：Flame.c
* 作者：Lixm 2017.10.17
* 说明：火焰驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "hw_types.h"
#include "flame.h"

/*********************************************************************************************
* 名称：flame_init()
* 功能：火焰传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void flame_init(void)
{
  PRCMPeripheralClkEnable(PRCM_GPIOA1, PRCM_RUN_MODE_CLK); //使能时钟
  PinTypeGPIO(PIN_01,PIN_MODE_0,false);                    //选择引脚为GPIO模式（gpio10）
  GPIODirModeSet(GPIOA1_BASE, G10_UCPINS, GPIO_DIR_MODE_IN);   //设置GPIO10为输入模式
  PinConfigSet(PIN_01,PIN_TYPE_STD_PD,PIN_MODE_0);         //下拉
}

/*********************************************************************************************
* 名称：unsigned char get_flame_status(void)
* 功能：获取火焰传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char get_flame_status(void)
{ 
  if((unsigned char)GPIOPinRead(GPIOA1_BASE,G10_UCPINS) > 0)                                                      //检测io口电平
    return 1;
  else
    return 0;
}