/*********************************************************************************************
* 文件：Hall.c
* 作者：Lixm 2017.10.17
* 说明：霍尔驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "hw_types.h"
#include "hall.h"

/*********************************************************************************************
* 名称：hall_init()
* 功能：霍尔传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void hall_init(void)
{
  PRCMPeripheralClkEnable(PRCM_GPIOA1, PRCM_RUN_MODE_CLK); //使能时钟
  PinTypeGPIO(PIN_02,PIN_MODE_0,false);                    //选择引脚为GPIO模式（gpio11）
  GPIODirModeSet(GPIOA1_BASE, G11_UCPINS, GPIO_DIR_MODE_IN);   //设置GPIO11为输入模式
  PinConfigSet(PIN_02,PIN_TYPE_STD_PU,PIN_MODE_0);         //上拉
}

/*********************************************************************************************
* 名称：unsigned char get_hall_status(void)
* 功能：获取霍尔传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char get_hall_status(void)
{ 
  if((unsigned char)GPIOPinRead(GPIOA1_BASE,G11_UCPINS) > 0)                                                      //霍尔传感器检测引脚
    return 0;                                                   //没有检测到信号返回 0
  else
    return 1;                                                   //检测到信号返回 1
}