/*********************************************************************************************
* 文件：infrared.c
* 作者：Lixm 2017.10.17
* 说明：人体红外驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "hw_types.h"
#include "infrared.h"

/*********************************************************************************************
* 名称：infrared_init()
* 功能：人体红外传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void infrared_init(void)
{
  PRCMPeripheralClkEnable(PRCM_GPIOA1, PRCM_RUN_MODE_CLK); //使能时钟
  PinTypeGPIO(PIN_04,PIN_MODE_0,false);                    //选择引脚为GPIO模式（gpio16）
  GPIODirModeSet(GPIOA1_BASE, G13_UCPINS, GPIO_DIR_MODE_IN);   //设置GPIO16为输入模式
  PinConfigSet(PIN_04,PIN_TYPE_STD_PD,PIN_MODE_0);         //上拉
}

/*********************************************************************************************
* 名称：unsigned char get_infrared_status(void)
* 功能：获取人体红外传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char get_infrared_status(void)
{ 
  if((unsigned char)GPIOPinRead(GPIOA1_BASE,G13_UCPINS) > 0)                                                      //人体红外传感器检测引脚
    return 1;                                                   //检测到信号返回 1
  else
    return 0;                                                   //没有检测到信号返回 0
}