/*********************************************************************************************
* 文件：vibration.c
* 作者：Lixm 2017.10.17
* 说明：震动驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "hw_types.h"
#include "vibration.h"

/*********************************************************************************************
* 名称：vibration_init()
* 功能：震动传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void vibration_init(void)
{
  
  PRCMPeripheralClkEnable(PRCM_GPIOA0, PRCM_RUN_MODE_CLK); //使能时钟
  PinTypeGPIO(PIN_58,PIN_MODE_0,false);                    //选择引脚为GPIO模式（gpio16）
  GPIODirModeSet(GPIOA0_BASE, G03_UCPINS, GPIO_DIR_MODE_IN);   //设置GPIO16为输入模式
  PinConfigSet(PIN_58,PIN_TYPE_STD_PU,PIN_MODE_0);         //上拉
  
}

/*********************************************************************************************
* 名称：unsigned char get_vibration_status(void)
* 功能：获取震动传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char get_vibration_status(void)
{ 
  if((unsigned char)GPIOPinRead(GPIOA0_BASE,G03_UCPINS) > 0)                                                      //振动传感器检测引脚
    return 0;                                                   //没有检测到信号返回 0
  else
    return 1;                                                   //检测到信号返回 1
}