/*********************************************************************************************
* 文件：main.c
* 作者：chennian 2017.11.2
* 说明：    
* 功能：看门的实验程序代码
* 实验现象：
*       主函数，上位机通过串口将数据发给原理机，串口调试助手和LCD屏幕上都会显示发送的信息，D3、
*      D4有数据时会闪烁     
*********************************************************************************************/
/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "delay.h"
#include "string.h"
#include "led.h"
#include "usart.h"


/*********************************************************************************************
* 名称:main()
* 功能:
* 参数:无
* 返回:无
* 修改:
* 注释:
*********************************************************************************************/
void main(void)
{
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);               //设置系统中断优先级分组 2
  led_init();                                                   //LED 初始化
  delay_count(168);                                             //延时初始化
  usart_init(115200);                                           //串口初始化
  
  printf("Hello IOT!\r\n\r\n");                                 //串口输出信息 
  usart_send("Usart is ready!\r\n",strlen("Usart is ready!\r\n"));//串口打印出提示信息
  turn_off(0x0f);                                               //熄灭LED
  for(;;){                                                      //无限循环
    if(Usart_len){                                              //如果串口接收缓冲区有数据
      turn_on(D3);                                              //点亮D3
      turn_on(D4);                                              //点亮D4
      delay_count(20);                                          //稍作延时  
      
      printf((char*)USART_RX_BUF);                              //将接收缓冲区的数据发送出去
      usart_send(USART_RX_BUF,Usart_len);                       //将接受到的数据发送给pc
      printf("\r\n");                                           //回车换行
      
      clean_usart();                                            //清空接收缓冲区
      delay_count(200);                                         //稍作延时  
      turn_off(D3);                                             //熄灭D3 
      turn_off(D4);                                             //熄灭D4 
    }  
  }
}