/*********************************************************************************************
* 文件：Beep.c
* 作者：
* 说明：
* 修改：
* 注释：
*********************************************************************************************/
/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "hw_types.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_apps_rcm.h"
#include "Beep.h"

/*********************************************************************************************
* 名称：Beep_init()
* 功能：蜂鸣器传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void Beep_init(void)
{
  PRCMPeripheralClkEnable(PRCM_GPIOA1, PRCM_RUN_MODE_CLK);      //使能时钟
  PinTypeGPIO(PIN_01,PIN_MODE_0,0);                           //选择引脚为GPIO模式（gpio03）
  GPIODirModeSet(GPIOA1_BASE, G10_UCPINS, GPIO_DIR_MODE_OUT);   //设置GPIO14为输出模式
  
  Beep_off(0x01);
}
  
/*********************************************************************************************
* 名称：Beep_on()
* 功能：蜂鸣器打开函数
* 参数：
* 返回：0，打开LED成功，-1，参数错误
* 修改：
* 注释：
*********************************************************************************************/
signed char Beep_off(unsigned char fan)
{
  if(fan & 0x01){                                                //如果要打开风扇
   GPIOPinWrite(GPIOA1_BASE, G10_UCPINS, 0xff);
    return 0;
  }
  
  return -1;                                                    //参数错误，返回-1
}

/*********************************************************************************************
* 名称：Beep_off()
* 功能：
* 参数：
* 返回：0，关闭成功，-1，参数错误
* 修改：
* 注释：
*********************************************************************************************/
signed char Beep_on(unsigned char fan)
{
  if(fan &0x01){                                                //如果要关闭风扇
    GPIOPinWrite(GPIOA1_BASE, G10_UCPINS, 0x00);
    return 0;
  }

  return -1;                                                    //参数错误，返回-1
}