/*********************************************************************************************
* 文件:relay.c
* 作者：liutong 2015.8.19
* 说明：板载继电器驱动程序
*       D1->PE0;D2->PE1;D3->PE2;D4->PE3;R->PB0;G->PB1;B->PB2
* 修改：
* 注释：
*
*********************************************************************************************/
/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stm32f4xx.h"

/*********************************************************************************************
* 全局变量
*********************************************************************************************/
static unsigned int sensor_status = 0;

/*********************************************************************************************
* 名称:relay_init()
* 功能:继电器初始化
* 参数:无
* 返回:无
* 修改:
* 注释:
*********************************************************************************************/
void relay_init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  
  GPIO_Init(GPIOC, &GPIO_InitStructure);  
  //GPIOC->BSRRL = GPIO_Pin_0 | GPIO_Pin_1;
}

/*********************************************************************************************
* 名称:sensor_get()
* 功能:继电器状态获取
* 参数:无
* 返回:无
* 修改:
* 注释:
*********************************************************************************************/
unsigned int sensor_get(void)
{
  return sensor_status;
}

/*********************************************************************************************
* 名称:sensor_control()
* 功能:继电器控制
* 参数:unsigned int cmd -- 控制命令
* 返回:无
* 修改:
* 注释:
*********************************************************************************************/
void sensor_control(unsigned int cmd)
{
  sensor_status = cmd;
  if(cmd & 0x01){
    GPIOC->BSRRL = GPIO_Pin_12;
  }else{
    GPIOC->BSRRH = GPIO_Pin_12;
  }
  if(cmd & 0x02){
    GPIOC->BSRRL = GPIO_Pin_13;
  }else{
    GPIOC->BSRRH = GPIO_Pin_13;
  }
}