/*********************************************************************************************
* 文件：led.h
* 作者：Liyw 2017.5.30
* 说明：led灯驱动代码头文件  
* 修改：
*********************************************************************************************/

/*********************************************************************************************
* 宏条件编译
*********************************************************************************************/
#ifndef __LED_H__
#define __LED_H__

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stm32f4xx.h"

/*********************************************************************************************
* 宏定义
*********************************************************************************************/
#define LED_PORT                GPIOE                           //宏定义LED端口为GPIOE
#define LED_CLK                 RCC_AHB1Periph_GPIOE            //宏定义LED时钟为RCC_AHB1Periph_GPIOE 
#define D1_PIN                  GPIO_Pin_0                      //宏定义D1管脚为GPIO_Pin_0
#define D2_PIN                  GPIO_Pin_1                      //宏定义D2管脚为GPIO_Pin_1
#define D3_PIN                  GPIO_Pin_2                      //宏定义D3管脚为GPIO_Pin_2
#define D4_PIN                  GPIO_Pin_3                      //宏定义D4管脚为GPIO_Pin_3

#define ON                      0                               //宏定义LED灯开启状态为ON
#define OFF                     1                               //宏定义LED灯关闭状态为OFF

#define D1                      0x01                            //宏定义D1数字编号
#define D2                      0x02                            //宏定义D2数字编号
#define D3                      0x04                            //宏定义D3数字编号
#define D4                      0x08                            //宏定义D4数字编号

/*********************************************************************************************
* 函数声明
*********************************************************************************************/
void led_init(void);                                            //LED灯初始化函数
void led_control(char num);                                     //LED灯控制函数
signed char led_status(char num);                              //LED灯状态查询函数
#endif /*__LED_H_*/