/*********************************************************************************************
* 文件：main.c
* 作者：Meixin 2017.09.25
* 说明：电源管理实验 例程    
*       实现PM0与PM1、PM2、PM3电源模式的相互转化
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <ioCC2530.h>
#include "delay.h"
#include "power.h"
#include "led.h"
#include "extint.h"

/*********************************************************************************************
* 名称：main()
* 功能：逻辑代码
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void main(void)
{ 
  xtal_init();                                                  //CC2530时钟初始化
  led_init();                                                   //LED控制端口初始化
  
  //PM0状态，亮灯并延时
  D1 = ON;                                                      //亮D1，表示统在PM0模式工作
  delay_s(1);                                                   //延时1秒钟  
  
  //PM1状态，灭灯
  set_stimer(1);                                                //设置睡眠定时器的定时间隔为1s
  stimer_init();                                                //开睡眠定时器中断
  D1 = OFF;                                                     //关闭D1
  delay_s(1);                                                   //延时1秒钟
  power_mode(1);                                                //设置电源模式为PM1  
  
  //1s后，由PM1进入PM2，亮灯并延时
  D1 = ON;                                                      //点亮D1
  D2 = ON;                                                      //点亮D2
  delay_s(1);                                                   //延时1秒钟 
  
  //PM2，灭灯
  set_stimer(2);                                                //设置睡眠定时器的定时间隔为2s
  D1 = OFF;                                                     //关闭D1
  D2 = OFF;                                                     //关闭D2
  delay_s(1);                                                   //延时1秒钟
  power_mode(2);                                                //设置电源模式为PM2
  
  //1s后，由PM2进入PM3，亮灯并延时
  D1 = ON;                                                      //点亮D1
  delay_s(1);                                                   //延时1秒钟 
  
  //PM3，灭灯  
  ext_init();                                                   //初始化外部中断
  D1 = OFF;                                                     //关闭D1
  delay_s(1);                                                   //延时1秒钟
  power_mode(3);                                                //设置电源模式为PM3  
  
  //当外部中断发生时，由PM3进入PM0，亮灯
  D1 = ON;                                                      //点亮D1
  
  while(1);
}

/*********************************************************************************************
* 名称：sleepTimer_IRQ(void)
* 功能：睡眠定时器中断服务程序
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
#pragma vector= ST_VECTOR
__interrupt void sleepTimer_IRQ(void)
{
  EA=0;                                                         //关中断   
  STIF=0;                                                       //睡眠定时器中断标志清0  
  EA=1;                                                         //开中断
}