/*********************************************************************************************
* 文件：power.c
* 作者：Meixin 2017.09.25
* 说明：电源管理驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "power.h"

/*********************************************************************************************
* 名称：stimer_init()
* 功能：睡眠定时器中断初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void stimer_init(void)
{
  ST2 = 0x00; 
  ST1 = 0x00; 
  ST0 = 0x00; 
  EA = 1;                                                       //开中断 
  STIE = 1;                                                     //睡眠定时器中断使能 0： 中断禁止     1： 中断使能
  STIF = 0;                                                     //睡眠定时器中断标志 0： 无中断未决   1： 中断未决
}

/*********************************************************************************************
* 名称：set_stimer(unsigned int sec)
* 功能：设置睡眠定时器的定时间隔
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void set_stimer(unsigned int sec)
{
  unsigned long sleepTimer = 0;
  
  sleepTimer |= ST0;                                             //取得目前的睡眠定时器的计数值
  sleepTimer |= (unsigned long)ST1 << 8;
  sleepTimer |= (unsigned long)ST2 << 16;
  
  sleepTimer += ((unsigned long)sec * (unsigned long)32768);   //加上所需要的定时时长
  
  ST2 = (unsigned char)(sleepTimer >> 16);                      //设置睡眠定时器的比较值
  ST1 = (unsigned char)(sleepTimer >> 8); 
  ST0 = (unsigned char)sleepTimer;
}

/*********************************************************************************************
* 名称：power_mode(unsigned char mode)
* 功能：选择电源模式
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void power_mode(unsigned char mode)
{ 
  if(mode < 4)
  {
    SLEEPCMD &= 0xfc;                                           //将SLEEP.MODE清0
    SLEEPCMD |= mode;                                           //选择电源模式
    PCON |= 0x01;                                               //启用此电源模式
  }                                                             //通过中断唤醒系统 
}